Конфигурация/Documents/НазначениеИнвестиционнойДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НазначениеИнвестиционнойДекларации</Name>
			<BasedOn>
				<xr:Item>Catalog.ИнвестиционныеДекларации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИнвестиционныеДекларации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНазначенийИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнвестиционныеДекларации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыНазначенийИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыНазначенийИнвестиционныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ТипыИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыИнвестиционныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитнаяВедомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаконодательныеОграничения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/НазначениеИнвестиционнойДекларации/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;

	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если ТекущийОбъект.ВидОперации = Перечисления.ВидыНазначенийИнвестиционныхДеклараций.Отмена Тогда
		ЭтаФорма.ИнвестиционнаяДекларация = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.ИнвестиционныеДекларации"));
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ОбновитьЭлементыФормыПоТипуИнвестиционнойДекларацииИВидуОперации(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТипИнвестиционнойДекларацииПриИзменении(Элемент)
	ОбновитьЭлементыФормыПоТипуИнвестиционнойДекларацииИВидуОперации(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИнвестиционнаяДекларацияПриИзменении(Элемент)
	
	Если Объект.ИнвестиционныеДекларации.Количество() = 0 Тогда
		Объект.ИнвестиционныеДекларации.Добавить();
	КонецЕсли; 
	Объект.ИнвестиционныеДекларации[0].ИнвестиционнаяДекларация = ЭтаФорма.ИнвестиционнаяДекларация;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвестиционныеДекларацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Для каждого ИнвестиционнаяДекларация Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.ИнвестиционныеДекларации.Добавить();
			НоваяСтрока.ИнвестиционнаяДекларация = ИнвестиционнаяДекларация;
		КонецЦикла; 
		ЭтаФорма.Модифицированность = Истина;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("ТипИнвестиционнойДекларации", Объект.ТипИнвестиционнойДекларации);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФормуМодально("Справочник.ИнвестиционныеДекларации.ФормаВыбора", ПараметрыФормы, Элементы.ИнвестиционныеДекларации);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтчетПоЛимитнойВедомости(Команда)
	
	ОтчетПоЛВ = ПолучитьОтчетПоЛимитнойВедомости(Объект.Ссылка, Объект.Организация, Объект.Дата);
	Если ТипЗнч(ОтчетПоЛВ) = Тип("ТабличныйДокумент") Тогда
		ОтчетПоЛВ.Показать(СтрШаблон("Лимитная ведомость %1 %2", Объект.Субъект, Объект.ВидДоговораДоверительногоУправления));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ОбновитьЭлементыФормыПоТипуИнвестиционнойДекларацииИВидуОперации(ЭтаФорма);
	
	Если Объект.ИнвестиционныеДекларации.Количество() <> 0 Тогда
		ЭтаФорма.ИнвестиционнаяДекларация = Объект.ИнвестиционныеДекларации[0].ИнвестиционнаяДекларация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыФормыПоТипуИнвестиционнойДекларацииИВидуОперации(ЭтаФорма)
	
	ЭтоНазначение = ЭтаФорма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНазначенийИнвестиционныхДеклараций.Назначение");
	
	ЭтоИнвестиционнаяДекларация = ЭтаФорма.Объект.ТипИнвестиционнойДекларации = ПредопределенноеЗначение("Перечисление.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация");
	ЭтоЛимитнаяВедомость 		= ЭтаФорма.Объект.ТипИнвестиционнойДекларации = ПредопределенноеЗначение("Перечисление.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость");
	
	ЭтаФорма.Элементы.ВидДоговораДоверительногоУправления.Видимость = Не ЭтоИнвестиционнаяДекларация;
	ЭтаФорма.Элементы.ИнвестиционныеДекларации.Видимость = Не ЭтоИнвестиционнаяДекларация И ЭтоНазначение;
	
	ЭтаФорма.Элементы.ИнвестиционнаяДекларация.Видимость = ЭтоИнвестиционнаяДекларация И ЭтоНазначение;
	
	ЭтаФорма.Элементы.ФормаКомандаОтчетПоЛимитнойВедомости.Видимость = ЭтоЛимитнаяВедомость И ЭтоНазначение;
	
	Если ЭтоИнвестиционнаяДекларация Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.СчетаДоверительногоУправления"));
		МассивТипов.Добавить(Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования"));
		ЭтаФорма.Элементы.Субъект.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	Иначе
		ЭтаФорма.Элементы.Субъект.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтчетПоЛимитнойВедомости(Ссылка, Организация, Дата)

	// Получить обработку импорта
	ОбработкаИмпортЛВ = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ИмпортЛимитныхВедомостей");
	Если ОбработкаИмпортЛВ = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружена обработка ""Импорт лимитных ведомостей"""); 
		Возврат Неопределено;
	КонецЕсли; 
	
	// Получить файл ЛВ
	ИмяФайлаЛВ = ПолучитьИмяФайлаЛВ(Ссылка);
	Если Не ЗначениеЗаполнено(ИмяФайлаЛВ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задано имя файла лимитной ведомости"); 
		Возврат Неопределено;
	КонецЕсли; 
	
	ДанныеФайла = ПолучитьДанныеФайлаИзДокументооборота(Ссылка, ИмяФайлаЛВ);
	Если ТипЗнч(ДанныеФайла) <> Тип("Структура") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует файл лимитной ведомости"); 
		Возврат Неопределено;
	КонецЕсли;
	ДанныеФайла.Вставить("ДатаСоздания", Дата);
	
	ФайлыДляОбработки = Новый Массив;
	ФайлыДляОбработки.Добавить(ДанныеФайла);
	
	// Прочитать файл
	ОбработкаИмпортЛВ.Организация = Организация;
	СтруктураТаблиц = ОбработкаИмпортЛВ.ПрочитатьФайлы(ФайлыДляОбработки, Ложь);
	
	Если СтруктураТаблиц.Ошибки.Количество() > 0 Тогда
		
		// Вывести ошибки
		Для каждого СтрокаОшибки Из СтруктураТаблиц.Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки.ОписаниеОшибки); 
		КонецЦикла;
		СводныйОтчет = Неопределено;
		
	Иначе
		
		// Сформировать отчет
		СводнаяТаблица = ОбработкаИмпортЛВ.ПолучитьСводнуюТаблицуЛимитов(СтруктураТаблиц);
		СводныйОтчет = ОбработкаИмпортЛВ.ПолучитьСводныйОтчет(СтруктураТаблиц.ГруппыЭмитентов, СводнаяТаблица);
		
	КонецЕсли; 
	
	Возврат СводныйОтчет;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьИмяФайлаЛВ(Ссылка)

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияДополнительныхСведений.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ЗначенияДополнительныхСведений.Свойство = ДополнительныеСведения.Ссылка
		|			И (ДополнительныеСведения.Ключ = ""ИнвестиционныеДекларации.ИмяФайлаЛимитнойВедомости"")
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Объект = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.Значение;
	
	КонецЕсли;

КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайлаИзДокументооборота(Ссылка, ИмяФайлаЛВ)

	ДанныеФайлов = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(Ссылка);
	
	Файл = Новый Файл(ИмяФайлаЛВ);
	Расширение = СтрЗаменить(Файл.Расширение, ".", "");
			
	Для каждого ДанныеФайла Из ДанныеФайлов Цикл	
		
		Если ДанныеФайла.Наименование = Файл.ИмяБезРасширения И ДанныеФайла.Расширение = Расширение Тогда
		
			ДанныеФайла = РаботаСФайловымХранилищем.ПолучитьФайл(ДанныеФайла.ИдентификаторФайла);
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес);
			УдалитьИзВременногоХранилища(ДанныеФайла.Адрес);
			
			Возврат Новый Структура("ДвоичныеДанные, ПолноеИмяФайла, ИмяФайла", ДвоичныеДанные, ИмяФайлаЛВ, ИмяФайлаЛВ);
		
		КонецЕсли; 
			
	КонецЦикла;

КонецФункции 

#КонецОбласти
